{
  "cards": [
    {
      "id": 1,
      "title": "Test Your Contact Forms",
      "category": "Workflows",
      "time": "10 min",
      "why": "A broken contact form means lost leads. You might not even know people are trying to reach you.",
      "how": "1. Fill out each form on your site\n2. Check if you receive the emails\n3. Does it look the way you want?\n4. Does the person filling out the form get a copy?\n5. What displays on the screen after they submit?",
      "stuck": "Need help troubleshooting your forms? Book a DIY Support Session."
    },
    {
      "id": 2,
      "title": "Test Your Checkout Flow",
      "category": "Workflows",
      "time": "15 min",
      "why": "It is important that your checkout process works but it also needs to be effortless and add value to your customer's experience. ",
      "how": "1. Is the buy button easy to fine? \n2. Add an item to cart (or start booking).\n3. Go through each step as a customer would.\n4. Complete a test purchase/booking\n5. Verify confirmation emails arrive",
      "stuck": "Stuck on a broken checkout? Let's fix it together in a DIY session."
    },
    {
      "id": 3,
      "title": "Test Your Email Opt-in Flow",
      "category": "Workflows",
      "time": "10 min",
      "why": "Your email list is one of your most valuable business assets. Make sure people can actually join it and get all the freebies you've promised them.",
      "how": "1. Sign up using a test email\n2. Check that welcome email arrives\n3. Verify that the email confirmation works\n4. Test that the unsubscribe link works too\n5. Did the opt-in offer work",
      "stuck": "Is your opt-in email workflow confusing? Book a session and we'll walk through it together."
    },
    {
      "id": 4,
      "title": "Test Your Login Workflows",
      "category": "Workflows",
      "time": "10 min",
      "why": "Do your customers need to login to access your products or services? Are you hosting your services on different platforms? It is important that a user can get from A to B without frustration. Testing login workflows are so important for creating a good customer experience.",
      "how": "1. Complete a form/purchase to trigger the page\n2. Check the messaging - is it clear?\n3. Verify any next steps are explained\n4. Make sure links work",
      "stuck": "Want to optimize your confirmation pages? Let's chat in a DIY session."
    },
    {
      "id": 5,
      "title": "Check Your Site on Mobile",
      "category": "Performance",
      "time": "15 min",
      "why": "Most visitors use phones. If your site looks broken on mobile, they'll leave.",
      "how": "1. Open your site on your phone\n2. Check every major page\n3. Test buttons and forms\n4. Make sure text is readable without zooming",
      "stuck": "Mobile site issues? We can fix them together."
    },
    {
      "id": 6,
      "title": "Run a Speed Test",
      "category": "Performance",
      "time": "5 min",
      "why": "Slow sites lose visitors. Even a 1-second delay impacts conversions.",
      "how": "1. Go to PageSpeed Insights (Google)\n2. Enter your homepage URL\n3. Review the score (aim for 80+)\n4. Note the top 3 issues to fix",
      "stuck": "Not sure how to speed up your site? Let's troubleshoot together."
    },
    {
      "id": 7,
      "title": "Test in Different Browsers",
      "category": "Performance",
      "time": "10 min",
      "why": "Your site might look perfect in Chrome but broken in Safari. Check both.",
      "how": "1. Open your site in Chrome\n2. Open it in Safari or Firefox\n3. Check if layouts look the same\n4. Test key functionality in both",
      "stuck": "Browser issues driving you crazy? Book a session."
    },
    {
      "id": 8,
      "title": "Update Your Copyright Year",
      "category": "Content",
      "time": "2 min",
      "why": "An outdated copyright makes your whole site look neglected.",
      "how": "1. Scroll to your footer\n2. Find the copyright year\n3. Update it to the current year\n4. Save and publish",
      "stuck": "Can't find where to edit your footer? We'll help you locate it."
    },
    {
      "id": 9,
      "title": "Review Your Bio - Is It Still Accurate?",
      "category": "Content",
      "time": "10 min",
      "why": "Your business evolves. Your bio should too.",
      "how": "1. Read your About page like a stranger would\n2. Update outdated info (years of experience, services, etc.)\n3. Make sure it reflects who you are NOW\n4. Save changes",
      "stuck": "Not sure how to rewrite your bio? Let's workshop it together."
    },
    {
      "id": 10,
      "title": "Check for Broken Links",
      "category": "Content",
      "time": "15 min",
      "why": "Broken links frustrate visitors and hurt your SEO.",
      "how": "1. Use a free tool like Dead Link Checker\n2. Enter your site URL\n3. Review the broken links report\n4. Fix or remove broken links",
      "stuck": "Overwhelmed by broken links? We can clean them up together."
    },
    {
      "id": 12,
      "title": "Review Your Services Page - Anything Outdated?",
      "category": "Content",
      "time": "15 min",
      "why": "If your services changed but your site didn't, you're confusing potential clients.",
      "how": "1. Read your services page\n2. Remove services you no longer offer\n3. Add new services\n4. Update pricing if it changed",
      "stuck": "Need help organizing your services page? Book a session."
    },
    {
      "id": 13,
      "title": "Update Your Headshot If 5+ Years Old",
      "category": "Content",
      "time": "20 min",
      "why": "Authenticity builds trust. If your headshot doesn't look like you anymore, clients might feel like it was a bait-and-switch. Don't be afraid to show up as who you are today, not who you were five years ago.",
      "how": "1. Check the date on your current headshot\n2. If it's 5+ years old, schedule a new photo\n3. Upload and replace the old one\n4. Update across all pages",
      "stuck": "Not sure how to upload a new photo? We'll walk you through it."
    },
    {
      "id": 14,
      "title": "Review Your 404 Error Page",
      "category": "Content",
      "time": "5 min",
      "why": "A helpful 404 page keeps visitors on your site instead of leaving frustrated.",
      "how": "1. Type a fake URL on your site (yoursite.com/fakepage)\n2. See what 404 page appears\n3. Make sure it has a search box or helpful links\n4. Add a friendly message",
      "stuck": "Want to customize your 404 page? Let's do it together."
    },
    {
      "id": 15,
      "title": "Jazz Up Your Unsubscribe Page",
      "category": "Content",
      "time": "10 min",
      "why": "Even when people leave, you can leave a good impression.",
      "how": "1. Unsubscribe from your own email list\n2. Review the unsubscribe page message\n3. Make it friendly and offer alternatives (reduce frequency?)\n4. Update and save",
      "stuck": "Not sure what to say on your unsubscribe page? We'll help you write it."
    },
    {
      "id": 16,
      "title": "Scan for Typos & Outdated Info",
      "category": "Content",
      "time": "20 min",
      "why": "You've read your site a hundred times. That's exactly why you can't see the typos anymore. Your brain fills in what should be there, not what actually is. Try to read your content with fresh eyes and catch any sneaky mistakes. ",
      "how": "1. Read your homepage, About, and Services pages\n2. Look for typos, weird spacing, formatting issues\n3. Check for outdated info (old address, phone, dates)\n4. Fix what you find",
      "stuck": "Want a second pair of eyes? Book a DIY session for a quick review."
    },
    {
      "id": 17,
      "title": "Check Image Alt Text",
      "category": "Usability/Accessibility",
      "time": "15 min",
      "why": "Alt text helps screen readers describe images to visually impaired visitors.",
      "how": "1. Right-click an image on your site\n2. Check if it has alt text\n3. Add descriptive alt text to images that don't have it\n4. Keep it concise and descriptive",
      "stuck": "Not sure how to add alt text on your platform? Let's figure it out."
    },
    {
      "id": 18,
      "title": "Run WAVE Accessibility Check",
      "category": "Usability/Accessibility",
      "time": "10 min",
      "why": "Accessible sites reach more people and rank better in search.",
      "how": "1. Go to wave.webaim.org\n2. Enter your site URL\n3. Review errors and warnings\n4. Note the top 3 issues to address",
      "stuck": "WAVE results overwhelming? We can prioritize what matters most."
    },
    {
      "id": 19,
      "title": "Check Color Contrast",
      "category": "Usability/Accessibility",
      "time": "10 min",
      "why": "Low contrast makes text hard to read, especially for people with vision issues.",
      "how": "1. Use WebAIM Contrast Checker\n2. Test your main text color against background\n3. Aim for a ratio of at least 4.5:1\n4. Adjust colors if needed",
      "stuck": "Not sure which colors to change? Let's pick accessible alternatives together."
    },
    {
      "id": 20,
      "title": "Make Sure Text Isn't an Image",
      "category": "Usability/Accessibility",
      "time": "10 min",
      "why": "Text in images can't be read by screen readers or resized by users.",
      "how": "1. Scan your site for images with text\n2. Replace with actual HTML text when possible\n3. If you must use images, add descriptive alt text\n4. Save changes",
      "stuck": "Need help converting image text to HTML? Book a session."
    },
    {
      "id": 21,
      "title": "Review Link Names (No 'Click Here')",
      "category": "Usability/Accessibility",
      "time": "15 min",
      "why": "Descriptive link text helps everyone understand where links go.",
      "how": "1. Scan pages for 'Click here' or 'Read more' links\n2. Replace with descriptive text ('View our services' instead of 'Click here')\n3. Make sure links make sense out of context\n4. Update and save",
      "stuck": "Not sure what to rename your links? We'll workshop better options."
    },
    {
      "id": 22,
      "title": "Check Font Sizes (Readable on Mobile?)",
      "category": "Usability/Accessibility",
      "time": "10 min",
      "why": "Tiny text on mobile forces people to zoom and makes reading painful.",
      "how": "1. Open your site on your phone\n2. Check if you have to zoom to read body text\n3. Text should be at least 16px on mobile\n4. Adjust if needed",
      "stuck": "Not sure how to change font sizes? Let's do it together."
    },
    {
      "id": 23,
      "title": "Test Keyboard Navigation",
      "category": "Usability/Accessibility",
      "time": "10 min",
      "why": "Some people navigate websites without a mouse. Make sure your site works for them.",
      "how": "1. Close your laptop touchpad or unplug your mouse\n2. Try navigating your site using only Tab and Enter keys\n3. Make sure you can reach all important links/buttons\n4. Note anything that's unreachable",
      "stuck": "Keyboard navigation issues? We can troubleshoot together."
    },
    {
      "id": 24,
      "title": "Review Form Labels & Error Messages",
      "category": "Usability/Accessibility",
      "time": "15 min",
      "why": "Clear labels and error messages help everyone fill out forms successfully.",
      "how": "1. Find a form on your site\n2. Check that every field has a clear label\n3. Try submitting with errors to see error messages\n4. Make sure error messages are helpful, not confusing",
      "stuck": "Forms confusing? Let's make them clearer together."
    },
    {
      "id": 25,
      "title": "Check for Software Updates",
      "category": "Performance",
      "time": "15 min",
      "why": "Outdated software leaves your site vulnerable to hackers and can cause crashes. Regular updates patch security holes, fix bugs, and keep everything running smoothly.",
      "how": "1. Back up your entire site first (so you can restore if something breaks)\n2. Check for available updates in your platform (WordPress dashboard, Squarespace, etc.)\n3. Update in this order: platform core first, then themes, then plugins\n4. After updating, test your site to make sure everything still works\n5. Check forms, checkout, and key pages",
      "stuck": "Worried about breaking your site with updates? We can help you update safely in a DIY session."
    }
  ],
  "encouragement": [
    "Every step forward matters - even the small ones.",
    "It's ok to take a break and rest.",
    "It's normal to be overwhelmed sometimes.",
    "You're exactly where you need to be right now.",
    "Small steps still move you forward.",
    "You're doing amazing!",
    "We are cheering you on!",
    "We believe in you!",
    "Give yourself the grace you'd give a friend.",
    "Taking a break doesn't erase your progress.",
    "You matter. Full stop.",
    "Not every day has to be productive.",
    "Look at you go! We're so proud of you.",
    "You're absolutely crushing it. Keep that momentum going!",
    "We see how hard you're working. You're incredible.",
    "You've got this. We're right here with you.",
    "Honestly? You're kind of a rockstar.",
    "The effort you're putting in? *Chef's kiss.* Beautiful.",
    "You're making it happen. That's huge.",
    "Can we just say how impressive you are? Because wow.",
    "Keep going! You're on fire right now.",
    "We hope you are as proud of you as we are!",
    "This energy? This commitment? We love it. Keep it up.",
    "We're over here doing a happy dance for you.",
    "You are a total rockstar in our book.",
    "The world needs more people like you.",
    "You're not just maintaining a site. You're being a total boss.",
    "Whatever you're doing, it's working. We're so here for it.",
    "You're putting in the work and it shows. We're so impressed.",
    "Honestly, you're inspiring. Keep shining.",
    "We're rooting for you harder than you know.",
    "Can we brag about you? Because you're doing something most people won't.",
    "We see you showing up and doing the work - wow!",
    "Today we are totally celebrating you. You're amazing.",
    "You're building something real here. That takes guts.",
    "The consistency? The follow-through? Standing ovation.",
    "You deserve all the good things coming your way.",
    "Keep trusting yourself. You know what you're doing.",
    "You can do it! We believe in you!",
    "You are such a bright light in this world!",
    "Your website is lucky to have you.",
    "Taking care of your site = taking care of your business."
  ]
}